[
    {
        "article": "A man with a rifle was arrested in a park near Senate office buildings across from Union Station in Washington on Tuesday, according to U.S. Capitol Police, who said there is no reason to believe there is an ongoing threat. The suspect was arrested after Capitol Police got a call about a man with a gun. They said on X that the suspect was in custody and that they had searched the park and would go through the man's belongings \"out of an abundance of caution.\" Capitol Police Chief Thomas Manger identified the suspect as Ahmir Lavon Merrell, 21, of Atlanta. Manger said at a news conference that the gun appeared to be a semi-automatic weapon that looked similar to an AR-15, though he could not confirm details about the weapon. Merrell has a warrant for a probation violation out of Georgia, Capitol Police said in a news release. It was not immediately clear why Merrell was in Washington. He faces five charges so far, including felon in possession of a firearm and fugitive from justice.Manger said the incident, on a day when the Senate was in session, unfolded shortly after 12:30 p.m. when an officer near a Senate office building was alerted to a man nearby with a gun. Officers ordered the man to stop, but he did not comply, so an officer used a stun gun on his back and took him into custody, Manger said. Officers were seen sprinting to the Capitol, followed by reporters, some of whom were not allowed to leave. A witness described the suspect as a tall Black man wearing an orange jumpsuit. More than half a dozen law enforcement vehicles responded. It took officers about three minutes to take the man into custody after they were alerted to the gun, Manger said. After that, the man was put in an ambulance so he could be treated from the use of the stun gun if necessary, Manger added. As of Tuesday afternoon's briefing, bomb technicians were still searching a bag the person left on a park bench, Manger said, noting that they have not found anything suspicious."
        , "source": "https://www.nbcnews.com/politics/congress/man-rifle-arrested-senate-office-buildings-rcna124043"
    },
    {
        "article": "A murder investigation has been launched after a 15-year-old boy was stabbed near a school in north west Leeds. Emergency services were called to Town Street in Horsforth, near St Margaret's Primary School, just before 15:00 GMT on Tuesday, West Yorkshire Police said. The boy, a former student at nearby Horsforth School, later died in hospital. One teenage boy has been arrested in connection with the incident. Initial reports suggested there had been two arrests. Det Ch Insp Stacey Atkinson, said: \"Our investigation is at an early stage and we are carrying out extensive enquiries to establish exactly what led to this needless loss of a young man's life. \"We understand the immense impact and huge shock a tragic incident of this nature will have on the community locally."
        , "Source": "https://www.bbc.com/news/uk-england-leeds-67347233"
    },
    {
        "article": "A war memorial is being guarded by police after protestors daubed it with \"Free Palestine\" graffiti. Greater Manchester Police (GMP) said the cenotaph was vandalised in Rochdale just after 16:00 GMT. GMP condemned the vandalism as \"criminal disrespect\" and Rochdale Council said it was \"totally unacceptable\". Pro-Palestinian protests have been held across the UK and the world since the Israel-Gaza war began. Prime Minister Rishi Sunak has also warned that war memorials could be \"desecrated\" on Armistice Day. Police community support officers are now guarding the cenotaph on the Esplanade, Rochdale, after the vandalism. GMP said there was also another incident of vandalism at the cenotaph on Monday when poppies were taken down. Ch Supt Nicky Porter said she was \"deeply saddened\" by the incidents and added that \"the memorial is a particularly poignant reminder of those who have given their lives to our country, particularly at this time of year\". \"We will not tolerate the criminal disrespect of the town's Memorial Gardens and I hope the action we have already taken in response to these two incidents reassures our communities of that,\" she added."
        , "source": "https://www.bbc.com/news/uk-england-manchester-67349510"
    },
    {
        "article": "Researchers say they have trained artificial intelligence to identify houses that need the most work to make them energy-efficient. The team at Cambridge University has developed a model which uses open-source data to pinpoint the problem areas in buildings. Some 700 'hard to decarbonise' houses have already been identified in Cambridge. The team is extending its work to other areas. The model is designed to help local authorities and other bodies make decisions about which houses to target when they are trying to reduce heat loss from buildings. The team says that these houses are responsible for over a quarter of all direct heating emissions, and they may be hard to decarbonise for many reasons, including their age, structure, and location. Dr Ronita Bardhan, who leads Cambridge's Sustainable Design Group, said: 'Policymakers need to know how many houses they have to decarbonize, but they often lack the resources to perform detailed audits on every house. Our model can direct them to high priority houses, saving them precious time and resources.' The model was 'trained' using data from energy performance certificates, which property owners need when selling or renting a property. Other data was added from street view images, aerial views and land-surface temperature measurements. The researchers say the model can classify houses with 90% precision, and this is expected to rise as more data is added. It can already pinpoint specific parts of buildings which are losing the most heat, such as doors and windows, and detect whether properties are old or new. A new framework is being created which will add data relating to energy use, poverty levels and thermal images of building facades. Models are being created for other cities and countries so they can benefit from the project, and the team is working with a space organisation so high-resolution thermal images from satellites can be used. Dr Bardhan believes the data will also help people living in Cambridge negotiate for more support in making their houses energy efficient. 'There is a lot of talk about the need for specialised skills to achieve decarbonisation, but these are simple datasets and we can make this model very user friendly and accessible for the authorities and individual residents,' she said."
        , "source": "https://www.bbc.com/news/uk-england-northamptonshire-67304128"
    }
]